[
  {
    "chunk_index": 1,
    "page_number": 1,
    "text": "Moolya Engineering\n\n14+\n\n200+",
    "heading_level_1": null,
    "heading_level_2": null,
    "heading_level_3": null,
    "section": null,
    "is_table": false
  },
  {
    "chunk_index": 2,
    "page_number": 2,
    "text": "Who we are\n\nAt Moolya Software Testing Private Limited, we lead globally in software testing and quality assurance, partnering with clients across industries to deliver top-tier solutions. Our services ranging from functional and automation to performance and security testing are designed to enhance software quality, efficiency, and productivity, ensuring client success and satisfaction.",
    "heading_level_1": "Who we are",
    "heading_level_2": null,
    "heading_level_3": null,
    "section": "Who we are",
    "is_table": false
  },
  {
    "chunk_index": 3,
    "page_number": 2,
    "text": "Why Choose us\n\nSkin in the Game\n\nCulture Focus\n\nLeadership Friendly\n\nWe go beyond vendor roles, fostering deep co-ownership with customers.\n\nWe help customers address issues by focusing on cultural fixes.\n\nMoolya empowers C-, V-, and D-level leaders with\n\ninsights.\n\nScaling Value\n\nMoolya unifies Tech, Test, Product, Customer & Business insights to scale value\n\nHome Screen\n\nA central hub to manage projects, start new edits, or generate Al­powered videos. Quick access to saved projects, recent work, and options to begin from scratch.\n\nPrompt to Video\n\nGenerate videos instantly by entering text prompts. Choose clip length or aspect ratio, and access a history of past prompts and generated outputs.\n\nAl Video Editor\n\nAn intuitive editor to refine raw or Al-generated clips. Add media, adjust cuts, and use Al-assisted tools for professional-quality video creation.\n\nPrompt based Video Editor\n\nA workspace where users can turn written scripts into engaging videos. The editor syncs text with visuals, showing real-time previews and timeline edits. It helps creators quickly transform ideas into polished content.",
    "heading_level_1": "Why Choose us",
    "heading_level_2": null,
    "heading_level_3": null,
    "section": "Why Choose us",
    "is_table": true
  },
  {
    "chunk_index": 4,
    "page_number": 7,
    "text": "Executive Summary\n\nThe rapid rise of short-form video platforms like Instagram and TikTok has transformed the way creators engage their audiences. For many, the process of transforming long talking-head content into engaging reels remains manual, time intensive, and inconsistent.\n\nMoolya proposes an AI-driven SaaS platform that automates this process end-to-end 4 from ingesting raw talking-head videos, analyzing stylistic references, transcribing speech, creating captions, inserting B-roll, and exporting optimized reels. The system is designed to align with user-defined style profiles, ensuring that each output reflects the creator’s unique identity while maintaining professional consistency.\n\nThe solution will be developed as a cloud-native, scalable SaaS platform with GPU-accelerated processing pipelines, modular architecture, and role-based access for individuals and teams. The initial build will focus on an MVP that produces Instagram-ready reels, with optional enhancements in subsequent phases (e.g., adaptive style learning, real-time previews).",
    "heading_level_1": "Executive Summary",
    "heading_level_2": null,
    "heading_level_3": null,
    "section": "Executive Summary",
    "is_table": false
  },
  {
    "chunk_index": 5,
    "page_number": 8,
    "text": "Our Solution Overview\n\nAutomated Reel Generation\n\nTransform raw talking-head content into styled, vertical reels with minimal manual effort.\n\nStyle Adaptation\n\nExtract visual elements (fonts, colors, captioning style, cut rhythm) from reference videos and apply them consistently.\n\nAI-Enhanced Editing\n\nIntegrate modules for transcription, jump cuts, captions, B-roll, and music overlays.\n\nPlatform Flexibility\n\nExport optimized videos for Instagram, TikTok, and other social platforms.\n\nScalable SaaS Architecture\n\nWeb-based dashboard with account\n\nmanagement, subscription models, analytics, and admin controls.\n\nCloud-Native & Secure Performance\n\nGPU-accelerated pipelines with autoscaling and\n\nCDN delivery, secured with role-based access and compliance-aligned data protection.",
    "heading_level_1": "Our Solution Overview",
    "heading_level_2": null,
    "heading_level_3": null,
    "section": "Our Solution Overview",
    "is_table": true
  },
  {
    "chunk_index": 6,
    "page_number": 10,
    "text": "Proposed High-Level Engineering Plan and Delivery\n\nS:No\n\nTask\n\nActivity\n\n01\n\nDiscovery & Alignment\n\nFinalize user workflows, reference style taxonomy, and architecture design.\n\nDefine MVP features, style parameters, and database schema.\n\n02\n\nData Preparation & Reference Analysis\n\nPreprocess sample reference videos.\n\nBuild normalization and tagging pipeline.\n\nDocument reproducible preprocessing steps.\n\n03\n\nAI/ML Model Development\n\nSpeech transcription (English + Hindi).\n\nSilence detection and jump cut logic.\n\nCaption generation with style replication.\n\nB-roll/music suggestion module.\n\n04\n\nRendering & Export\n\nFFmpeg-based integration.\n\nPresets for Instagram/TikTok reels.\n\nAutomated export workflows.\n\nS:No\n\nTask\n\nActivity\n\n05\n\nSaaS Platform Development\n\nUser dashboard with upload, preview, style profiles.\n\nSubscription, billing, and admin monitoring features.\n\nTeam role-based access.\n\n06\n\nCloud Infra & Scalability\n\nGPU-powered pipelines.\n\nObject storage + CDN.\n\nAutoscaling, monitoring, alerting.\n\n07\n\nDocumentation & Handover\n\nDeveloper & user documentation.\n\nTraining sessions (live/recorded).\n\nAssumptions\n\n• 1.\n• All cloud, SMS/notification gateways, and third-party licence fees are borne by the client.\n• 2.\n• Infrastructure keys remain in the client9s control; Moolya deploys only within those accounts.\n• 3.\n• A dedicated client Product Owner is available for sprint ceremonies and day-to-day clarifications.\n• 4.\n• Client supplies brand guidelines, legal disclaimers before design starts.\n• 5.\n• Pilot data: at least three months of anonymised case study samples are provided to bootstrap Al models .\n• 6.\n• Baseline performance tests target will be handled; higher loads may require additional infra.\n• 7.\n• Delays in API credentials, compliance approvals, or data access will proportionally extend effort and cost.\n• 8.\n• Any additional scenarios/APls treated as change requests.\n• 9.\n• Iterations beyond agreed scope billed additionally.",
    "heading_level_1": "Proposed High-Level Engineering Plan and Delivery",
    "heading_level_2": "Assumptions",
    "heading_level_3": null,
    "section": "Proposed High-Level Engineering Plan and Delivery > Assumptions",
    "is_table": true
  },
  {
    "chunk_index": 7,
    "page_number": 14,
    "text": "Sprint Model & Workflow Rhythm\n\nSprint-based Delivery\n\nWork will be broken into structured sprints with clear objectives, demos,\n\nAdaptive Planning\n\nProgress Syncs\n\nDemo & Review\n\nEach sprint will begin with a scope review and planning activity involving both teams.\n\nRegular check-ins will be scheduled to ensure visibility, unblock issues, and incorporate feedback early.\n\nAt the end of each sprint, demonstrable outcomes will be shared, with room for iteration or course correction.\n\nRetrospectives\n\nThank You!",
    "heading_level_1": "Sprint Model & Workflow Rhythm",
    "heading_level_2": null,
    "heading_level_3": null,
    "section": "Sprint Model & Workflow Rhythm",
    "is_table": true
  }
]